package com.example.blogtour.data

class RepoPostListImpl {


//    private val dataPost: List<Post> = listOf(
//        Post("0",
//            "nick0",
//            "foto",
//            "Главной целью нашего большого" +
//                    " автомобильного путешествия был национальный парк" +
//                    " Грейт Смоки Маунтинс. Смоки – это огромный массив" +
//                    " леса площадью несколько тысяч квадратных километров." +
//                    " Размещается все это богатство на территории" +
//                    " относительно невысокого горного...",
//            54,
//            "Теннесси — США",
//            "01.02.2019",
//            "02.12.2022"),
//        Post("1",
//            "nick1",
//            "foto",
//            "В дождливый день в Стамбуле мы с Наташей" +
//                    " решили посетить самый известный музей" +
//                    " Турции — Археологический, считающийся" +
//                    " одним из лучших в своём роде в мире." +
//                    " Выйдя из Музея мозаик, по узким улочкам района...",
//            10,
//            "Теннесси — США",
//            "01.02.2019",
//            "02.12.2022"),
//        Post("2",
//            "nick2",
//            "foto",
//            "Главной целью нашего большого" +
//                    " автомобильного путешествия был национальный парк" +
//                    " Грейт Смоки Маунтинс. Смоки – это огромный массив" +
//                    " леса площадью несколько тысяч квадратных километров." +
//                    " Размещается все это богатство на территории" +
//                    " относительно невысокого горного...",
//            51,
//            "Теннесси — США",
//            "01.02.2019",
//            "02.12.2022"),
//        Post("3",
//            "nick3",
//            "foto",
//            "В дождливый день в Стамбуле мы с Наташей" +
//                    " решили посетить самый известный музей" +
//                    " Турции — Археологический, считающийся" +
//                    " одним из лучших в своём роде в мире." +
//                    " Выйдя из Музея мозаик, по узким улочкам района...",
//            10,
//            "Теннесси — США",
//            "01.02.2019",
//            "02.12.2022"),
//
//        )


}